# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# list_length = int(input("Введите длину списка: "))
# list = []
# count = 0
# for i in range (1, list_length + 1):
#     list.append(i)
# print(*list)
# search_number = int(input("Введите число: "))
# print(f"Ваше число встречается {list.count(search_number)} раз(а)")



